ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/IWDT_1.0.xml
    <register id="IWDT_A2DAY" width="32" offset="0x1144" description="RTC Alarm Day Of Week / Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="ADOW" description="Alarm Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x6" description="Highest possible value"/>
        </bitfield>
        <bitfield id="ADOWAE" description="Alarm Day of week enable. This bit are valid if RTCBCD=1 or RTCBCD=0." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No alarm"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMBIN" description="Alarm Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="12" end="8" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="ADOMAEBIN" description="Alarm Day of month Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.   0x0= Alarm disabled.   0x1= Alarm enabled." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No alarm"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMLOWBCD" description="Alarm Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="ADOMHIGHBCD" description="Alarm Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3" description="Highest possible value"/>
        </bitfield>
        <bitfield id="ADOMAEBCD" description="Alarm Day of month BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.   0x0= Alarm disabled.   0x1= Alarm enabled." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No alarm"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
    <register id="IWDT_PSCTL" width="32" offset="0x1148" description="RTC Prescale Timer 0/1 Control Register">
        <bitfield id="RT0IP" description="Prescale timer 0 interrupt interval" begin="4" end="2" width="3" rwaccess="R/W">
            <bitenum id="INT244US" value="0x2" description="Interval every 244 microsecond"/>
            <bitenum id="INT488US" value="0x3" description="Interval every 488 microsecond"/>
            <bitenum id="INT0P98MS" value="0x4" description="Interval every 0.98 milisecond"/>
            <bitenum id="INT1P95MS" value="0x5" description="Interval every 1.95 milisecond"/>
            <bitenum id="INT3P91MS" value="0x6" description="Interval every 3.91 milisecond"/>
            <bitenum id="INT7P81MS" value="0x7" description="Interval every 7.81 milisecond"/>
        </bitfield>
        <bitfield id="RT1IP" description="Prescale timer 1 interrupt interval" begin="20" end="18" width="3" rwaccess="R/W">
            <bitenum id="INT15P6MS" value="0x0" description="Interval every 15.6 milisecond"/>
            <bitenum id="INT31P3MS" value="0x1" description="Interval every 31.3 milisecond"/>
            <bitenum id="INT62P5MS" value="0x2" description="Interval every 62.5 milisecond"/>
            <bitenum id="INT125MS" value="0x3" description="Interval every 125 milisecond"/>
            <bitenum id="INT250MS" value="0x4" description="Interval every 250 milisecond"/>
            <bitenum id="INT500MS" value="0x5" description="Interval every 500 milisecond"/>
            <bitenum id="INT1S" value="0x6" description="Interval every 1 second"/>
            <bitenum id="INT2S" value="0x7" description="Interval every 2 second"/>
        </bitfield>
    </register>
    <register id="IWDT_EXTPSCTL" width="32" offset="0x114C" description="RTC Prescale Timer 2 Control Register">
        <bitfield id="RT2PS" description="Prescale timer 2 interrupt interval" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="INT4S" value="0x0" description="Interval every 4 second"/>
            <bitenum id="INT8S" value="0x1" description="Interval every 8 second"/>
            <bitenum id="INT16S" value="0x2" description="Interval every 16 second"/>
        </bitfield>
    </register>
    <register id="IWDT_TSSEC" width="32" offset="0x1150" description="Time Stamp Seconds Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="SECBIN" description="Time Stamp Second Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECLOWBCD" description="Time Stamp Seconds BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECHIGHBCD" description="Time Stamp Seconds BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="IWDT_TSMIN" width="32" offset="0x1154" description="Time Stamp Minutes Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MINBIN" description="Time Stamp Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MINLOWBCD" description="Time Stamp Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MINHIGHBCD" description="Time Stamp Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="IWDT_TSHOUR" width="32" offset="0x1158" description="Time Stamp Hours Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="HOURBIN" description="Time Stamp Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="4" end="0" width="5" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x17" description="Highest possible value"/>
        </bitfield>
        <bitfield id="HOURLOWBCD" description="Time Stamp Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="HOURHIGHBCD" description="Time Stamp Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="13" end="12" width="2" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x2" description="Highest possible value"/>
        </bitfield>
    </register>
