ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/IWDT_1.0.xml
    <register id="IWDT_TSDAY" width="32" offset="0x115C" description="Time Stamp Day Of Week / MonthRegister - Calendar Mode With Binary / BCD Format">
        <bitfield id="DOW" description="Time Stamp Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0." begin="2" end="0" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x6" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMBIN" description="Time Stamp Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="12" end="8" width="5" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMLOWBCD" description="Time Stamp Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMHIGHBCD" description="Time Stamp Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="21" end="20" width="2" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="IWDT_TSMON" width="32" offset="0x1160" description="Time Stamp Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MONBIN" description="Time Stamp Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xC" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONLOWBCD" description="Time Stamp Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONHIGHBCD" description="Time Stamp Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="IWDT_TSYEAR" width="32" offset="0x1164" description="Time Stamp Years Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="YEARLOWBIN" description="Time Stamp Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARHIGHBIN" description="Time Stamp Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARLOWESTBCD" description="Time Stamp Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DECADEBCD" description="Time Stamp Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTLOWBCD" description="Time Stamp Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTHIGHBCD" description="Time Stamp Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="30" end="28" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x4" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="IWDT_TSSTAT" width="32" offset="0x1168" description="Time Stamp Status Register">
        <bitfield id="TSTIOEVT0" description="Tamper I/O 0 caused time stamp event" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
        <bitfield id="TSVDDEVT" description="Loss of VDD caused time stamp event" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
    </register>
