ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/IWDT_1.0.xml
    <register id="IWDT_TSCTL" width="32" offset="0x116C" description="Time Stamp Control Register">
        <bitfield id="TSTIOEN0" description="Time Stamp by Tamper I/O 0 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSVDDEN" description="Time Stamp by VDD Loss detection enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSCAPTURE" description="Defines the capture method of the RTC timestamp when a time stamp event occurens." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Time stamp holds RTC capture at first occurrence of time stamp event."/>
            <bitenum id="LAST" value="0x1" description="Time stamp holds RTC capture at last occurrence of time stamp event."/>
        </bitfield>
    </register>
    <register id="IWDT_TSCLR" width="32" offset="0x1170" description="Time Stamp Clear Register">
        <bitfield id="CLR" description="Clear time stamp and status register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="clear time stamp event"/>
        </bitfield>
    </register>
    <register id="IWDT_LFSSRST" width="32" offset="0x11F0" description="Low frequency sub-system reset request">
        <bitfield id="VBATPOR" description="If set, the register bit will request a power on reset to the PMU of the LFSS." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing this value has no effect."/>
            <bitenum id="SET" value="0x1" description="Request power on reset to the LFSS."/>
        </bitfield>
    </register>
    <register id="IWDT_RTCLOCK" width="32" offset="0x11FC" description="Real time clock lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RTC counter is writable."/>
            <bitenum id="SET" value="0x1" description="RTC counter is read only access."/>
        </bitfield>
    </register>
    <register id="IWDT_WDTEN" width="32" offset="0x1300" description="Watchdog Timer Enable Register">
        <bitfield id="ENABLE" description="Enable bit for the WDT." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Disable WDT"/>
            <bitenum id="SET" value="0x1" description="Enable WDT"/>
        </bitfield>
    </register>
    <register id="IWDT_WDTDBGCTL" width="32" offset="0x1304" description="Watchdog Timer Debug Control Register">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The WDT freezes functionality while the CPU is Halted during debug and resumes when the CPU is active."/>
            <bitenum id="RUN" value="0x1" description="The WDT ignores the state of the CPU Halted debug state."/>
        </bitfield>
    </register>
    <register id="IWDT_WDTCTL" width="32" offset="0x1308" description="Watchdog Timer Control Register">
        <bitfield id="CLKDIV" description="Module Clock Divider, Divide the clock source by CLKDIV+1. Divider values from /1 to /8 are possible." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="Minimum value"/>
            <bitenum id="MAX" value="0x7" description="Maximum value"/>
        </bitfield>
        <bitfield id="PER" description="Timer Period of the WDT. These bits select the total watchdog timer count." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="PER_EN_25" value="0x0" description="Total timer count is 2^25"/>
            <bitenum id="PER_EN_21" value="0x1" description="Total timer count is 2^21"/>
            <bitenum id="PER_EN_18" value="0x2" description="Total timer count is 2^18"/>
            <bitenum id="PER_EN_15" value="0x3" description="Total timer count is 2^15"/>
            <bitenum id="PER_EN_12" value="0x4" description="Total timer count is 2^12 (default)"/>
            <bitenum id="PER_EN_10" value="0x5" description="Total timer count is 2^10"/>
            <bitenum id="PER_EN_8" value="0x6" description="Total timer count is 2^8"/>
            <bitenum id="PER_EN_6" value="0x7" description="Total timer count is 2^6"/>
        </bitfield>
    </register>
    <register id="IWDT_WDTCNTRST" width="32" offset="0x130C" description="Watchdog Timer Counter Reset Register">
        <bitfield id="RESTART" description="Writing 03A7h to this register restarts the WDT Counter. Writing any other value causes a POR level reset. Read as 0x0h." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="VALUE" value="0x3A7" description="VALUE to restart the WDT counter"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="IWDT_WDTSTAT" width="32" offset="0x1310" description="Watchdog Timer Status Register">
        <bitfield id="RUN" description="Watchdog running status flag." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="STOP" value="0x0" description="Watchdog counter stopped."/>
            <bitenum id="RUN" value="0x1" description="Watchdog running."/>
        </bitfield>
    </register>
    <register id="IWDT_WDTLOCK" width="32" offset="0x13FC" description="Watchdog timer lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the WDTEN and WDTCTL from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Watchdog timer control is writable."/>
            <bitenum id="SET" value="0x1" description="Watchdog timer control is read only access."/>
        </bitfield>
    </register>

</module>